from utils import joinseq

##############
# Korean Roots

## A: Adjective (removed final consonant which will be dropped during conjugatation)
# can be conjugated to                  # VS             AS          ASN        AVC           AVM         AVN         #
KR_Aa = '나ㅃ|바ㅃ'                     # 나ㅃ+ㅏ지다    나ㅃ+ㅡ+다  나ㅃ+ㅡ+ㄴ 나ㅃ+ㅏ서     나ㅃ+ㅡ+게  나ㅃ+ㅡ+지  #
KR_Ab = '귀여|더|무서|쉬|차가|추|해로'  # 귀여+워지다    귀여+ㅂ+다  귀여+운    귀여+워서     귀여+ㅂ+게  귀여+ㅂ+지  #
KR_Ac = '맑'                            # 맑+아지다      맑+다       맑+은      맑+아서       맑+게       맑+지       #
KR_Ad = '다'            # sweet         # 다+ㄹ+아지다   다+ㄹ+다    다+ㄴ      다+ㄹ+아서    다+ㄹ+게    다+ㄹ+지    #
KR_Ae = '예ㅃ'                          # 예ㅃ+ㅓ지다    예ㅃ+ㅡ+다  예ㅃ+ㅡ+ㄴ 예ㅃ+ㅓ서     예ㅃ+ㅡ+게  예ㅃ+ㅡ+지  #
KR_Af = '다'            # different     # 다+ㄹ+라지다   다+르+다    다+른      다+ㄹ+라서    다+르+게    다+르+지    #
KR_Ah = '깔끔|매끈|복잡|비슷|착|지저분' # 착+해지다      착+하다     착+한      착+해서       착하게      착하지      #
KR_Ai = '붉'                            # 붉+어지다      붉+다       붉+은      붉+어서       붉+게       붉+지       #
KR_Aj = '같|괜찮|낮|높|좋'              # 같+아지다      같+다       같+은      같+아서       같+게       같+지       #
KR_Al = '섣부'                          # x              섣부+르다   섣부+른    섣부+ㄹ+러서  섣부+르게   섣부+르지   #
KR_Am = '맛있'                          # 맛있+어지다    맛있+다     맛있+는    맛있+어서     맛있+게     맛있+지     #
KR_An = '낯서|머'                       # 머+ㄹ+어지다   머+ㄹ+다    머+ㄴ      머+ㄹ+어서    머+ㄹ+게    머+ㄹ+지    #
KR_Ao = '넓'                            # 넓+어지다      넓+다       넓+은      넓+어서       넓+게       넓+지       #
KR_Ap = '희'                            # 희+어지다      희+다       희+ㄴ      희+어서       희+게       희+지       #
KR_Ar = '이로|평화로'                   # 이로+와지다    이로+ㅂ+다  이로+운    이로+와서     이로+ㅂ+게  이로+ㅂ+지  #
KR_As = '나'                            # 나+아지다      나+ㅅ+다    나+은      나+아서       나+ㅅ+게    나+ㅅ+지    #
KR_Aw = '고'                            # 고+와지다      고+ㅂ+다    고+운      고+와서       고+ㅂ+게    고+ㅂ+지    #

# '쓰다(bitter)' is not included because it is ambiguous with '쓰다(write)'
KR_Ax = 'ㅋ'                            # ㅋ+ㅓ+지다,     ㅋ+ㅡ+다,   ㅋ+ㅓ+서,     ㅋ+ㅡ+게,   ㅋ+ㅡ+지,   ㅋ+ㅡ+ㄴ

KR_Ay = '못ㄷ'                          # 못ㄷ+ㅙ+지다,   못ㄷ+ㅚ+다, 못ㄷ+ㅙ+서,   못ㄷ+ㅚ+게, 못ㄷ+ㅚ+지, 못ㄷ+ㅚㄴ


## roots of verb

### Both(intransives can conjugate to transive)
#                                   # intransive                    transive
#                                   # no-tense  past      present   no-tense     past         intension
KR_VCg = "숨"                       # 숨+다     숨+었+다  숨+는+다  숨+ㄱ+ㅣ+다  숨+ㄱ+였+다  숨+ㄱ+ㅣ+ㄹ
KR_VCi = "먹|죽"                    # 먹+다     먹+었+다  먹+는+다  먹+이+다     먹+여+ㅆ+다  먹+일
KR_VCl = "살"                       # 살+다     살+았+다  산+다     살+리+다     살+렸+다     살+릴

### Intransive
#                                   # no-tense    past           present
KR_VIa = "가"                       # 가+다       가+ㅆ+다       가+ㄴ+다
KR_VIe = "야물|여물"                # 여무+ㄹ+다  여무+ㄹ+었+다  여무+ㄴ+다
KR_VIy = "숨죽ㅇ|생ㄱ|쓰러ㅈ|해ㅈ"  # 생ㄱ+ㅣ+다  생ㄱ+ㅕ+ㅆ+다  생ㄱ+ㅣ+ㄴ+다
KR_VIl = "조"                       # 조+ㄹ+다    조+ㄹ+았+다    조+ㄴ+다
KR_VIs = "잘나"                     # 잘나+다     잘나+ㅆ+다

### Transive
#                                   # active                            passive
#                                   # no-tense   present    past        no-tense      present          past            
KR_VTg = "박|붙잡|잡"               # +다        +는+다     +았+다      +히+다        +힌+다           +혔+다        
KR_VTh = "먹|읽"                    # +다        +는+다     +었+다      +ㅎ+ㅣ+다     +ㅎ+ㅣ+ㄴ+다     +ㅎ+ㅕ+ㅆ+다
KR_VTi = "보"                       # +다        +ㄴ+다     +았+다      +ㅇ+ㅣ+다     +ㅇ+ㅣ+ㄴ+다     +ㅇ+ㅕ+ㅆ+다
KR_VTl = "가" # grind               # +ㄹ+다     +ㄴ+다     +ㄹ+았+다   +ㄹ+ㄹ+ㅣ+다  +ㄹ+ㄹ+ㅣ+ㄴ+다  +ㄹ+ㄹ+ㅕ+ㅆ+다 
KR_VTm = "거|드|미"                 # +ㄹ+다     +ㄴ+다     +ㄹ+었+다   +ㄹ+ㄹ+ㅣ+다  +ㄹ+ㄹ+ㅣ+ㄴ+다  +ㄹ+ㄹ+ㅕ+ㅆ+다  
KR_VTn = "빠" # wash                # +ㄹ+다     +ㄴ+다     +ㄹ+았+다   +ㄹ+ㄹ+ㅣ+다  +ㄹ+ㄹ+ㅣ+ㄴ+다  +ㄹ+ㄹ+ㅕ+ㅆ+다  
KR_VTy = "나ㄴ"                     # +ㅜ+다     +ㅜ+ㄴ+다  +ㅝ+ㅆ+다   +ㅟ+다        +ㅟ+ㄴ+다        +ㅟ+었+다      

### Active
KR_VAd = "내밀|넣|말|받들|빼|재|쳐들|쪼|찍|허물"  # ~다(da)
KR_VAh = "가까이"                   # 가까이+하+다  가까이+했+다  가까이+한+다 x
KR_VAi = "내ㅊ|당ㄱ|[되]?[돌살]ㄹ|망ㅊ|숨ㄱ|외ㅊ|[드]높|되뇌|죽|[보]살ㅍ" # ~ㅣ다(ida)
KR_VAl = "[되][돌살]|[쳐]올|[내때]"  # ~리다(lida)
KR_VAu = "ㅊ|낮ㅊ|늦ㅊ"             # +ㅜ+다     +ㅜ+ㄴ+다  +ㅝ+ㅆ+다        
KR_VAw = "[치채]"  # ~우다(wuda)

### Status
KR_S = "긴요|섬세|장대|장렬|졸렬|중요|진부|참신"
